# BuiltInFailures.LevelFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LevelFailures Class
BuiltInFailures Class Members See Also
---
Failures about Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class LevelFailures
```

Visual Basic
---
```text
Public NotInheritable Class LevelFailures
```

Visual C++
---
```text
public ref class LevelFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..LevelFailures
# See Also
BuiltInFailures..::..LevelFailures Members
Autodesk.Revit.DB Namespace